ckmx-zkp/My_4inch_LVGL/sdkconfig.defaults
# Build target
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash: 16MB (N16R8), dual-slot OTA ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---- PSRAM (octal SPIRAM on ESP32-S3-WROOM-1 N16R8) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# ---- CPU 240MHz ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- SoftAP not needed (station only) ----
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# ---- Larger main task stack for LVGL setup ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- LVGL: use color depth 16, swap for RGB panel off ----
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
# Real LVGL pool is 512KB in PSRAM (main/CMakeLists.txt). This Kconfig
# value is unused when LV_MEM_POOL_ALLOC is set; keep it modest so a
# fallback .bss pool would not blow internal RAM.
CONFIG_LV_MEM_SIZE_KILOBYTES=48
